TRUNCATE TABLE projects RESTART IDENTITY CASCADE;

TRUNCATE TABLE users RESTART IDENTITY CASCADE;

INSERT INTO public.users(name, job_title, job_intro, self_pr, cv_url, github_url, company, start_date, end_date, year_exp, certification, frontend_tech, backend_tech, tool, learning)VALUES('DUONG VI HUNG ','ブリッジSE(BrSE) ','株式会社 VTI ジャパンにて約３年間、主に小売業界のシステム開発に従事。特に、ブリッジ SE として顧客（日本）と
開発チーム（母国）の間に立ち、言語と文化の壁を越えて円滑なプロジェクト進行を主導した経験が豊富です。要件
定義や設計といった上流工程に加え、プロジェクトリーダーの経験もございます。
これまでの上流工程と PMP で学んだマネジメントの知識を土台に、今後は実装の知見に裏打ちされた本質的な設計スキ
ルを身につけたいと考えております。
エンジニアの主体的な成長を支援する貴社で、技術力とビジネス感覚を兼ね備え、構想から完成までを導けるエンジニ
アとして、事業の成功に貢献したいです。 ','私の強みは、技術的視点とビジネス的視点を両立させ、主体的に課題を解決する力です。
これまでのキャリアを通じて、常に「どうすればもっと良くなるか」を考え、チームやプロジェクトに貢献してきま
した。具体的には、Excel 関数を活用した定型業務の効率化（SQL クエリ生成）による生産性向上、チーム全体の対応
力を高める仕組み作り（問い合わせ対応の標準化）による属人化の解消、そして顧客との円滑な合意形成を主導する
スコープマネジメントなど、多角的な視点から課題解決を実践してまいりました。
今後は、この課題解決能力を土台に、実装スキルを本格的に習得したいと考えております。貴社の一員として、技術
力とビジネス感覚を兼ね備えたエンジニアへと成長し、事業の発展に貢献していきたいです。 ','None ','https://github.com/DUONGVIHUNG ','VTIジャパン株式会社 ','2023/04 ','現在 ',2,'日本語能力試験 N1:2021 年 12 月,IT パスポート資格:2024 年 06 月,Oracle JAVA シルバ:2024 年 11 月,プロジェクトマネジメントプロフ
ェッショナル(PMP):2025 年 07 月 ', ' JavaScript,React,HTML5&CSS3,Tailwind CSS ','Java, Spring boot,PostgreSQL ','Git,Git hub,Docker, Render, Vercel, Postman, Excel ','アルゴリズム, AWS基本,CICD,アジャイル（Agile）プロジェクト管理 ');


INSERT INTO public.projects(user_id, project_name, start_date, end_date, my_role, detail, tech_stack, project_size, lesson_learn_, project_phase)VALUES(1,'商品スキャンアプリのプラットフォー
ム運用保守','2023 年 06 月','2025 年 02 月','ブリッジ SE','スパー内に買い手が自らのスマホで商品をスキャンしたり、ポイントを貯めたり、
決済したりできるアプリのプラットフォームの改修、追加機能開発、運用および保
守','
Java,C#,AWS Linux,AWS,PostgreSQL,Oracle','全 20 名','言語・文化の壁を越える、丁寧なコミュニケーションの徹底
顧客（日本）と開発チーム（母国）の間に立ち、円滑なコミュニケーションのハ
ブとなることを常に意識していました。単に言葉を翻訳するだけでなく、顧客の要
望の背景にあるビジネス目的や、開発チームの技術的な懸念事項などを、双方の文
化や立場を考慮しながら丁寧に伝えることを心掛けました。この取り組みにより、
両者の信頼関係を構築し、プロジェクトを円滑に進行させることに貢献しました。','要件整理、基本設計');

INSERT INTO public.projects(user_id, project_name, start_date, end_date, my_role, detail, tech_stack, project_size, lesson_learn_, project_phase)VALUES(1,'EC一元管理システムのプラットフォー
ム運用保守','2024 年02 月','2025年02 月','ブリッジ SE','店舗や受注や出荷などの情報を一元管理し、EC 運営における業務の効率化を促進さ
せるシステムのプラットフォームの改修、追加機能開発、運用および保守','Java ,
Windows,
AWS,
SQL Server,
Oracle,','全 20 名','① 店舗データ設定業務の自動化による、導入リードタイムの短縮と品質向上
新規店舗のマスタ設定作業において、手作業での SQL 作成が非効率でした。この
課題に対し、Excel の関数を駆使して、パラメータを入力するだけで SQL クエリが生
成される仕組み（テンプレート）を作成。これにより、1 店舗あたりの設定作業を大
幅に短縮し、設定ミスの防止にも貢献しました。
② 顧客向け障害報告プロセスの標準化と迅速化
障害発生時の顧客向け報告メッセージをテンプレート化し、チーム内に展開。顧
客への第一報に要する時間を大幅に短縮し、報告品質の均一化を実現しました','要件整理、基本設計、運用支援');

INSERT INTO public.projects(user_id, project_name, start_date, end_date, my_role, detail, tech_stack, project_size, lesson_learn_, project_phase)VALUES(1,'汎用勤怠管理システムの共通基盤プラットフォー
ム運用保守','2025 年 02 月','2025 年 05 月','サブリーダ
ー','SIer の下請けで既存の勤怠管理システムプラットフォームに追加機能を開発','Java，
Linux ,
AWS,
PostgreSQL','全 4 名','①設計書の解読と展開による、開発チームの認識統一と生産性向上
顧客から提供された日本語の設計書を深く読み解き、要点をまとめた補足資料を
作成してチームに展開。メンバーの設計理解度を高め、仕様の認識齟齬を未然に防
止しました。
②問い合わせ対応の標準化とチーム全体の対応力強化
顧客からの問い合わせは専門用語が多く、日本語が堪能な私に集中し、業務が属
人化しているという課題がありました。
この課題を解決するため、過去の問い合わせ内容を分析し、その共通の回答をまと
めて、回答テンプレートを作成。さらに、通訳ツールとテンプレートを組み合わせ
た対応手順を整備し、日本語が得意ではない他のメンバーにも共有しました。
この仕組みの導入により、私以外のメンバーでも一次対応が可能となり、チーム全
体の問い合わせ対応品質と速度が向上。結果として、業務の属人化を解消し、より
安定したサポート体制の構築に貢献しました。','詳細設計');

INSERT INTO public.projects(user_id, project_name, start_date, end_date, my_role, detail, tech_stack, project_size, lesson_learn_, project_phase)VALUES(1,'受注・発注システム開発','2025 年 05 月','現在','ブリッジ SE','オンプレミスのシステムをクラウド環境にマイグレーションし、新機能追加を開発','Java ,
Linux,
AWS,
PostgreSQL','全 8 名','チーム連携による適切なスコープマネ-ジメントと円滑な合意形成
顧客からの要望が当初の契約範囲（スコープ）を逸脱する傾向があったため、プ
ロジェクトの健全性を維持することを目指しました。
私はまず、契約内容と要求仕様を照らし合わせ、スコープ外の要望を客観的にリ
ストアップ。その上で、上司やチームと影響範囲や対応方針を協議しました。
顧客には、チームで検討した代替案や正式な仕様変更プロセスを建設的に提案し、
無秩序な作業範囲の拡大（スコープクリープ）を抑制。安易な受け入れではなく、
双方納得の上での合意形成に努めました。','要件定義、基本設計、テスト');


